<img src= "MSTS_Logo.png" style ="width:400px;height:400px"/>

## Advanced Pandas
In this notebook, we will be going over some more advanced features of the pandas library.

In [3]:
import pandas as pd

In [4]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Analyst':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[91,85,86,94,97,99]}

In [8]:
df = pd.DataFrame(data)
df

  Company  Analyst  Sales
0    GOOG      Sam     91
1    GOOG  Charlie     85
2    MSFT      Amy     86
3    MSFT  Vanessa     94
4      FB     Carl     97
5      FB    Sarah     99

In [17]:
#groupby method allows you to group your df according to columns values
df.groupby('Company')

In [18]:
bycomp = df.groupby('Company')

In [14]:
bycomp.mean()

         Sales
Company
FB          98
GOOG        88
MSFT        90

In [15]:
bycomp.sum()

         Sales
Company
FB         196
GOOG       176
MSFT       180

In [16]:
bycomp.std()

            Sales
Company
FB       1.414214
GOOG     4.242641
MSFT     5.656854

In [24]:
#Find a specific statistic for a specific company
#Below we leverage groupby with many diffrent methods
bycomp.sum().loc['FB']

Sales    196
Name: FB, dtype: int64

In [21]:
df.groupby('Company').sum().loc['FB']

Sales    196
Name: FB, dtype: int64

In [22]:
df.groupby('Company').count()

         Analyst  Sales
Company
FB             2      2
GOOG           2      2
MSFT           2      2

In [23]:
df.groupby('Company').max()

         Analyst  Sales
Company
FB         Sarah     99
GOOG         Sam     91
MSFT     Vanessa     94

In [17]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [18]:
df.groupby('Person').describe()

        Sales
        count   mean std    min    25%    50%    75%    max
Person
Amy       1.0  340.0 NaN  340.0  340.0  340.0  340.0  340.0
Carl      1.0  243.0 NaN  243.0  243.0  243.0  243.0  243.0
Charlie   1.0  120.0 NaN  120.0  120.0  120.0  120.0  120.0
Sam       1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
Sarah     1.0  350.0 NaN  350.0  350.0  350.0  350.0  350.0
Vanessa   1.0  124.0 NaN  124.0  124.0  124.0  124.0  124.0

In [26]:
#The transpose method transposes the matrix
bycomp.describe().transpose()

Company             FB       GOOG       MSFT
Sales count   2.000000   2.000000   2.000000
      mean   98.000000  88.000000  90.000000
      std     1.414214   4.242641   5.656854
      min    97.000000  85.000000  86.000000
      25%    97.500000  86.500000  88.000000
      50%    98.000000  88.000000  90.000000
      75%    98.500000  89.500000  92.000000
      max    99.000000  91.000000  94.000000

## Merging, Joining, Concatenating

When we have diffrent datasets, we may want to merge them, add columns together etc. In order to do this we will use a few helpful methods built into pandas.

In [27]:
df1 = pd.DataFrame({'Sales': [100, 100, 100, 100],
                        'Profit Margin': [50, 60, 70, 80],
                        'Net income': [10,10,20,20],
                        'Expenses': [50,40,30,20]},
                        index=['Stock1', 'Stock2', 'Stock3', 'Stock4'])

In [28]:
df1

        Sales  Profit Margin  Net income  Expenses
Stock1    100             50          10        50
Stock2    100             60          10        40
Stock3    100             70          20        30
Stock4    100             80          20        20

In [30]:
df2 = pd.DataFrame({'Sales': [100, 100, 100, 100],
                        'Profit Margin': [50, 60, 70, 80],
                        'Net income': [10,10,20,20],
                        'Expenses': [50,40,30,20]},
                        index=['Stock5', 'Stock6', 'Stock7', 'Stock8'])

In [31]:
df2

        Sales  Profit Margin  Net income  Expenses
Stock5    100             50          10        50
Stock6    100             60          10        40
Stock7    100             70          20        30
Stock8    100             80          20        20

In [44]:
df3 = pd.DataFrame({'Sales': [100, 100, 100, 100],
                    'Profit Margin': [50, 60, 70, 80],
                    'Net income': [10,10,20,20], 
                   'Expenses': [50,40,30,20]},
                    index=['Stock9', 'Stock10', 'Stock11', 'Stock12'])

In [45]:
df3

         Sales  Profit Margin  Net income  Expenses
Stock9     100             50          10        50
Stock10    100             60          10        40
Stock11    100             70          20        30
Stock12    100             80          20        20

In [46]:
#How do we glue the dataframes together (create a df with all rows)
#Axis by default is 0
pd.concat([df1, df2, df3])

         Sales  Profit Margin  Net income  Expenses
Stock1     100             50          10        50
Stock2     100             60          10        40
Stock3     100             70          20        30
Stock4     100             80          20        20
Stock5     100             50          10        50
Stock6     100             60          10        40
Stock7     100             70          20        30
Stock8     100             80          20        20
Stock9     100             50          10        50
Stock10    100             60          10        40
Stock11    100             70          20        30
Stock12    100             80          20        20

In [49]:
# Merging dataframes
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [50]:
#Notice the one columns these dfs have in common is key column
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [51]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [52]:
#We are merging the data frames on the same key column they share (relationship)
#This is typically ideal when we have a date column
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [53]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [55]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [56]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [54]:
#This only selects rows from left and right that have the same two keys
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [35]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [36]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

# Operations
We can do many operations with dataframes using the columns, rows, subsets of these and more.

In [58]:
import pandas as pd
df = pd.DataFrame({'FY2019':[100,200,300,400],'FY2020':[200,300,400,500],'FY2021':['abc','def','ghi','xyz']})
df.head()

   FY2019  FY2020 FY2021
0     100     200    abc
1     200     300    def
2     300     400    ghi
3     400     500    xyz

In [60]:
#Returns array of all unique values
df['FY2020'].unique()

array([200, 300, 400, 500])

In [63]:
#Returns number of unique values
df['FY2020'].nunique()

4

In [65]:
df['FY2020'].value_counts()

300    1
400    1
500    1
200    1
Name: FY2020, dtype: int64

In [67]:
df[df['FY2020']>200]

   FY2019  FY2020 FY2021
1     200     300    def
2     300     400    ghi
3     400     500    xyz

In [74]:
#Apply method
#Think about it, you can create any method and apply it to a column
def times2(x):
    return x*2

In [75]:
df['FY2020'].apply(times2)

0     400
1     600
2     800
3    1000
Name: FY2020, dtype: int64

In [76]:
#The lambda method is used instead of defining a function
df['FY2020'].apply(lambda x: x*2)

0     400
1     600
2     800
3    1000
Name: FY2020, dtype: int64

In [77]:
df.drop('FY2020', axis = 1)

   FY2019 FY2021
0     100    abc
1     200    def
2     300    ghi
3     400    xyz

In [80]:
#Remember inplace parameter if you want changes to stick
df.columns

Index(['FY2019', 'FY2020', 'FY2021'], dtype='object')

In [81]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [84]:
df.sort_values('FY2020', ascending = False)

   FY2019  FY2020 FY2021
3     400     500    xyz
2     300     400    ghi
1     200     300    def
0     100     200    abc

In [85]:
df.isnull()

   FY2019  FY2020  FY2021
0   False   False   False
1   False   False   False
2   False   False   False
3   False   False   False

# Pivot Tables in Python
Much like you would use in Excel, you can make pivot tables in python as well.

In [86]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [87]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [88]:
df.pivot_table(values = 'D', index = ['A','B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [ ]:
#This is merely an example, we will not go indepth in this tutorial on pivot tables
#Personally, if you are going to use pivots, I would suggest importing the file into excel first
#We will see how to do this below

# Data Input

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
#IMPORTANT METHODS

In [89]:
#The read_csv method allows you to read IN a csv from your workind directory
df = pd.read_csv('file_name')

FileNotFoundError: [Errno 2] File file_name does not exist: 'file_name'

In [ ]:
#The to_csv method allows you to turn a dataframe you have in python into a csv file
df.to_csv('file_name', index = False)

In [ ]:
#Please do try it out with your own files

In [ ]:
#The read_excel method allows you to read in an excel file
pd.read_excel('Sample_Excel.xlsx',sheetname='Sheet1')

In [90]:
#The to_excel method allows you to turn a df into an excel file
df.to_excel('Sample_Excel.xlsx',sheet_name='Sheet1')

# HTML
Now this is where it gets cool. If you see some data on a website you would like to access, remember that every webiste is relaly just a piece of code, and pieces of code can be read.

Firstly make sure you have 

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

and if you do not have them use these prompts to download them

In [91]:
#This will read off a table into a df
df = pd.read_html('website_url_with_table_in_it')

ValueError: No tables found

### See you in the next one!

### - Your MSTS Team